[
  {
    "id": 1,
    "title": "Black Knight",
    "price": 14.99,
    "genre": "Action",
    "image_url": "/cinema-booking/images/1.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "PG-13",
    "description": "Black Knight is a fictional fantasy adventure comedy that follows the story of Jamal Walker, a mischievous and underachieving employee at a medieval-themed amusement park. One fateful day, while cleaning the park's moat, Jamal retrieves a mysterious medallion and is unexpectedly transported back in time to 14th-century England. There, he is mistaken for a French nobleman and becomes entangled in the court of the tyrannical King Leo. With the help of a rebellious chambermaid and a disgraced knight, Jamal adopts the persona of the legendary Black Knight to lead a rebellion, using modern-day tactics to inspire the oppressed peasants. The film blends slapstick humor with a fish-out-of-water narrative, exploring themes of courage and identity."
  },
  {
    "id": 2,
    "title": "Darkness Descends",
    "price": 14.99,
    "genre": "Horror",
    "image_url": "/cinema-booking/images/2.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "R",
    "description": "Darkness Descends is a chilling horror movie that follows a group of friends who venture into an abandoned mansion for a weekend getaway. However, the mansion holds dark secrets, and soon the friends find themselves fighting for their lives against a malevolent force that has been awakened. The movie explores fear, isolation, and the supernatural as they race against time to escape the house before it's too late."
  },
  {
    "id": 3,
    "title": "Swirl",
    "price": 14.99,
    "genre": "Action",
    "image_url": "/cinema-booking/images/3.jpg",
    "availability": "Coming Soon",
    "release_date": "12/16/2026",
    "age_rating": "PG-13",
    "description": "Swirl is a fast-paced action film set in a futuristic world where technology and human interaction collide. A team of elite agents is tasked with tracking down a dangerous criminal mastermind who has developed a new form of cybernetic technology that could change the world forever. The team must navigate through high-stakes missions, deadly enemies, and a web of lies as they fight to stop the villain’s plans."
  },
  {
    "id": 5,
    "title": "A True Champion",
    "price": 14.99,
    "genre": "Drama",
    "image_url": "/cinema-booking/images/5.jpg",
    "availability": "Coming Soon",
    "release_date": "12/16/2026",
    "age_rating": "PG",
    "description": "A True Champion tells the inspiring story of a young athlete who overcomes adversity to achieve his dreams. Faced with personal struggles and the pressure of competition, he learns valuable lessons about determination, sacrifice, and the importance of teamwork. This heartfelt drama explores themes of resilience and the power of the human spirit to triumph over life's obstacles."
  },
  {
    "id": 6,
    "title": "Prince And His Secrets",
    "price": 14.99,
    "genre": "Drama",
    "image_url": "/cinema-booking/images/6.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "PG",
    "description": "Prince And His Secrets is a historical drama set in a royal kingdom where a young prince struggles to balance the duties of his throne with the weight of his family’s expectations. As he uncovers dark secrets hidden within the royal court, the prince must navigate political intrigue and familial loyalty while discovering his own identity and the true meaning of leadership."
  },
  {
    "id": 7,
    "title": "The Spooky Night",
    "price": 14.99,
    "genre": "Horror",
    "image_url": "/cinema-booking/images/7.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "PG-13",
    "description": "The Spooky Night is a horror-comedy film set in a haunted castle where a group of adventurers must solve the mystery of a cursed knight who haunts the grounds. As they uncover the truth behind the ghostly presence, they are forced to confront their own fears and unravel the dark history that ties the knight to the castle’s tragic past."
  },
  {
    "id": 8,
    "title": "The Witch Village",
    "price": 14.99,
    "genre": "Mystery",
    "image_url": "/cinema-booking/images/8.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "PG",
    "description": "The Witch Village is a captivating mystery film that follows a young journalist investigating the eerie disappearances of people in a secluded village rumored to be cursed. As she digs deeper into the village’s history, she uncovers dark secrets and supernatural forces that may have been behind the disappearances. What she discovers will challenge everything she knows about reality and the supernatural."
  },
  {
    "id": 9,
    "title": "House",
    "price": 14.99,
    "genre": "Mystery",
    "image_url": "/cinema-booking/images/9.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "PG-13",
    "description": "House is a thrilling mystery that takes place in a massive, old mansion where a group of strangers are invited to spend the weekend. As the weekend unfolds, strange occurrences and cryptic clues lead the group to suspect that they are being watched by someone—or something. Secrets unravel as they race to solve the mystery before they become the next victims of the house’s dark past."
  },
  {
    "id": 10,
    "title": "Charging to Victory",
    "price": 14.99,
    "genre": "Drama",
    "image_url": "/cinema-booking/images/10.jpg",
    "availability": "Coming Soon",
    "release_date": "12/16/2026",
    "age_rating": "PG",
    "description": "Charging to Victory is an uplifting drama about a group of underdog athletes who come together to form a team and fight for a chance at victory in a high-stakes competition. Each member of the team has their own struggles to overcome, but through perseverance and teamwork, they discover the true meaning of success."
  },
  {
    "id": 11,
    "title": "First Fist",
    "price": 14.99,
    "genre": "Drama",
    "image_url": "/cinema-booking/images/11.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "PG-13",
    "description": "First Fist is a gritty drama about a boxer who fights against the odds to achieve greatness. Struggling with personal demons and an abusive trainer, he must navigate a world of crime and corruption to make it to the championship fight. Along the way, he learns about the true cost of success and the importance of redemption."
  },
  {
    "id": 12,
    "title": "Betrayal",
    "price": 14.99,
    "genre": "Drama",
    "image_url": "/cinema-booking/images/12.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "PG-13",
    "description": "Betrayal is a heart-wrenching drama about a woman who discovers that the man she loves has been hiding a dark secret. As she grapples with the revelation, she must decide whether to forgive him or walk away from the relationship forever. The movie explores themes of trust, deception, and the complexities of love."
  },
  {
    "id": 13,
    "title": "Out The Chamber",
    "price": 14.99,
    "genre": "Horror",
    "image_url": "/cinema-booking/images/13.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "R",
    "description": "Out The Chamber is a gripping horror film that follows a group of criminals who break out of prison and find themselves trapped in a strange, isolated mansion. As they struggle to survive and escape, they begin to experience terrifying visions and encounter dark forces that haunt the mansion. The deeper they delve into the house, the more they realize that the horrors within are far worse than anything they could imagine."
  },
  {
    "id": 14,
    "title": "Other Side",
    "price": 14.99,
    "genre": "Mystery",
    "image_url": "/cinema-booking/images/14.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "PG",
    "description": "Other Side is a suspenseful mystery film about a detective who is investigating a series of disappearances that seem to have no explanation. As she dives deeper into the case, she starts to uncover strange coincidences that suggest there might be a connection between the disappearances and a hidden world beyond the physical realm. The movie explores themes of parallel universes and the unknown."
  },
  {
    "id": 15,
    "title": "Highway",
    "price": 14.99,
    "genre": "Action",
    "image_url": "/cinema-booking/images/15.jpg",
    "availability": "Coming Soon",
    "release_date": "12/16/2026",
    "age_rating": "PG-13",
    "description": "Highway is an action-packed thriller about a former race car driver who is forced to compete in an illegal underground racing competition to save his family from a dangerous criminal syndicate. With high-speed chases and thrilling stunts, the film is a non-stop ride that keeps you on the edge of your seat."
  },
  {
    "id": 16,
    "title": "Raven",
    "price": 14.99,
    "genre": "Horror",
    "image_url": "/cinema-booking/images/16.jpg",
    "availability": "Coming Soon",
    "release_date": "12/16/2026",
    "age_rating": "R",
    "description": "Raven is a chilling horror movie that centers around a mysterious bird that has been haunting a small village. The villagers believe the bird brings misfortune, but as the story unfolds, it becomes clear that there is a much darker force at play. A group of people must band together to uncover the truth behind the raven's curse before it consumes them all."
  },
  {
    "id": 17,
    "title": "Vulture",
    "price": 14.99,
    "genre": "Action",
    "image_url": "/cinema-booking/images/17.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "PG-13",
    "description": "Vulture is an action-packed thriller about a team of elite soldiers who must track down a rogue agent who has gone rogue with classified information. The agent, known as 'Vulture,' has vanished without a trace, and it's up to this team to find him before the dangerous secrets he carries fall into the wrong hands."
  },
  {
    "id": 18,
    "title": "Special Agent",
    "price": 14.99,
    "genre": "Action",
    "image_url": "/cinema-booking/images/18.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "PG-13",
    "description": "Special Agent is a fast-paced spy action film that follows an elite operative tasked with preventing a global catastrophe. As the agent uncovers a conspiracy involving corrupt government officials and shadow organizations, he must use all his skills to stay one step ahead of those trying to stop him."
  },
  {
    "id": 19,
    "title": "Walk Alone",
    "price": 14.99,
    "genre": "Drama",
    "image_url": "/cinema-booking/images/19.jpg",
    "availability": "Coming Soon",
    "release_date": "12/16/2026",
    "age_rating": "PG",
    "description": "Walk Alone is a poignant drama about a man who struggles to find his place in the world after losing his job and family. Forced to face his demons, he embarks on a journey of self-discovery and redemption. This film is about overcoming personal challenges and finding strength in the most unexpected places."
  },
  {
    "id": 20,
    "title": "Who Is The Liar",
    "price": 14.99,
    "genre": "Mystery",
    "image_url": "/cinema-booking/images/20.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "PG-13",
    "description": "Who Is The Liar is a gripping mystery thriller that centers around a woman who uncovers a tangled web of lies in her search for the truth. As she digs deeper, she realizes that everyone around her may have something to hide, and no one is who they claim to be. Can she solve the mystery before it's too late?"
  },
  {
    "id": 21,
    "title": "Believe",
    "price": 14.99,
    "genre": "Comedy",
    "image_url": "/cinema-booking/images/21.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "PG",
    "description": "Believe is a heartwarming comedy about a man who must come to terms with the fact that his life isn’t going as planned. He finds himself at a crossroads and begins to re-examine his relationships and life choices. As he embarks on a new journey of self-discovery, he learns that belief in himself might be the key to everything."
  },
  {
    "id": 22,
    "title": "Sail of Fate",
    "price": 14.99,
    "genre": "Comedy",
    "image_url": "/cinema-booking/images/22.jpg",
    "availability": "Retrospective",
    "release_date": "12/16/2024",
    "age_rating": "PG",
    "description": "Sail of Fate is a light-hearted comedy about a group of friends who embark on a sailing adventure. What starts as a carefree vacation soon turns into an unforgettable journey as they face unexpected challenges at sea. The movie is filled with humorous situations and charming characters."
  },
  {
    "id": 23,
    "title": "Dark",
    "price": 14.99,
    "genre": "Horror",
    "image_url": "/cinema-booking/images/23.jpg",
    "availability": "Now Playing",
    "release_date": "12/16/2025",
    "age_rating": "R",
    "description": "Dark is a horror movie about a mysterious force that begins to spread throughout a quiet town. People start disappearing without a trace, and those who remain begin to feel the suffocating presence of an evil that is gradually taking over the town. The survivors must confront their deepest fears to try to stop the darkness before it consumes them all."
  }
]
